app/controllers/users_controller.rb

INSERT INTO "users" ("emp_id", "name", "phone1", "phone2", "post_number", "address", "other", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
---
  def create
    @user = User.create(user_params)
    @users = User.all

UPDATE "users" SET "name" = ?, "other" = ?, "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "三浦 奈々777"], ["other", ""], ["birthday", "1997-11-05"], ["updated_at", "2016-02-29 06:23:18.900828"], ["id", 57]]
SELECT "users".* FROM "users"
---
  def update
    if @user.update(user_params)
      @users = User.all